# SetObjectTags

## Description
Lets the user set a list of Tags on an object such as a Class,Layer or Resource.

```pascal
FUNCTION SetObjectTags(
				objectHandle : HANDLE;
				arrTags      : ARRAY): BOOLEAN;
```

```python
def vs.SetObjectTags(objectHandle, arrTags):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHandle|HANDLE|The object to set Tags on.|
|arrTags|ARRAY|The arra of Tag Strings.|

## Examples
#### VectorScript ####
```pascal
Procedure Test;

Var		H1:		Handle;
		A1:		Array[1..2] of string;
		B1:		Boolean;

Begin
	H1:=FLayer;
	A1[1]:='Tag One';
	A1[2]:='Tag Two';
	B1:=SetObjectTags(H1,A1);
ENd;

Run(Test);
```
#### Python ####
```python
import vs

def SetTags():
	# List of tags i want to add
	l = ('Tag One','Tag Two')

	# Handle to the thing i want to add the label to
	h = vs.FLayer()

	# Function for setting the label
	vs.SetObjectTags(h, l)

SetTags()
```
VectorScript ====
```pascal
Procedure Test;

Var		H1:		Handle;
		A1:		Array[1..2] of string;
		B1:		Boolean;

Begin
	H1:=FLayer;
	A1[1]:='Tag One';
	A1[2]:='Tag Two';
	B1:=SetObjectTags(H1,A1);
ENd;

Run(Test);
```

#### Python ####
```python
import vs

def SetTags():
	# List of tags i want to add
	l = ('Tag One','Tag Two')

	# Handle to the thing i want to add the label to
	h = vs.FLayer()

	# Function for setting the label
	vs.SetObjectTags(h, l)

SetTags()
```

Sample VS by Pat Stanford
Sample PY by TWK, koenr, and Pat Stanford 4-12-24

```pascal
resultOK := SetObjectTags(objectHandle, arrTags);
```
```python
import vs

# Lets the user set a list of Tags on an object such as a Class,Layer or
# Resource.
objectHandle = vs.FSActLayer()  # handle to the first selected object on the active layer
arrTags = []

ok = vs.SetObjectTags(objectHandle, arrTags)
if ok:
    vs.Message('SetObjectTags succeeded')
else:
    vs.Message('SetObjectTags failed')
```

## Version
Availability: from Vectorworks 2019

## Category
* General Edit